---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SiteLocation
source: html/ba2d8e8a-9ed4-9302-db48-4253ead4d1c8.htm
---
# SiteLocation Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.